alti.code.studio.backend.bak/artillery.config.yml
config:
  target: "http://127.0.0.1:5001/api/v1"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warm up"
    - duration: 20
      arrivalRate: 20
      rampTo: 50
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 50
      name: "Sustained high load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health & Status Check"
    flow:
      - get:
          url: "/agents/status"
      - think: 1
      - get:
          url: "/agents/status"